// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'.

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою
// перетворіть значення на число за допомогою Number().


// const number = Number(prompt("введіть число:").trim());

// if (!number) {
//     alert ("Невірне число")
// }
// if (message === 10) {
//     alert('Вірно');
// } else {
//     alert ('Невірно')
// }

// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"

// const min = Math.floor(Math.random() * (59 - 0) + 0);



// const min = 78;

// if (min > 45 && min <= 60) {
//     alert(`${min} входить в 4 чверть`);
// } else if (min > 30 && min <= 44) {
//     alert(`${min} входить в 3 чверть`);
// } else if (min > 15 && min <= 29) {
//     alert(`${min} входить в 2 чверть`);
// } else if (min > 0 && min <= 14) {
//     alert(`${min} входить в 1 чверть`);
// } else {
//     alert("Ви ввели невірне число");
// }



// Напишіть код, який запитуватиме у користувача
// логін за допомогою prompt і виводить результат в консоль браузера

// Після цього додайте перевірку введеного користувачем значення:
// Якщо відвідувач вводить "Адмін",
// то prompt запитує пароль (не забудьте зберігти його у змінну для подальшої перевірки).
// Якщо нічого не ввели або натиснули Cancel,
// Вивести в alert строку "Скасовано"
// В іншому випадку вивести в alert рядок "Я вас не знаю"

// Пароль перевіряти так:
// Якщо введено пароль "Я головний",
// то вивести в alert рядок "Добрий день!",
// в іншому випадку вивести в alert рядок "Невірний пароль!"


// const login = prompt("Віедвть логін:");
// console.log(login);

// if (login === "Адмін") {
//     const password = prompt("Введіть пароль:");

//     if (password === "Я головний") {
//         alert("Добрий день!");
//     } else if (password === null || password === "") {
//         alert("Скасовано");
//     } else {
//         alert("Невірний пароль!");
//     }
// }
// else if (login === null || login === "") {
//     alert("Скасовано");
// } else {
//     alert("Я вас не знаю");
// }


// Напишіть функцію getNumbers(min, max), що приймає 2 параметри -
// мінімальне і максимальне число відповідно.
// Напишіть цикл всередині функції, який виводить у консоль
// всі числа від max до min за спаданням.
// Окрім цього, підрахуйте суму всіх парних чисел в цьому циклі
// і поверніть її з функції.


// function getNumbers(min, max) {
//     let totalSum = 0;
    
//     for (let i = max; i >= min; i--) {
//         console.log(i);
//         if (i % 2 === 0) {
//             totalSum += i;
//        }
//     }
//     return totalSum;
// }

// Напишіть функцію min(a, b), яка приймає 2 числа і повертає меньше з них.
// Потрібно додати перевірку, що функція отримує саме числа, в іншому випадку
// повертати з функції рядок - 'Not a number!'.

// function min(a, b) {
//     const c = Number(min);
//     if (a < b) {
//         return a;
//     } else {
//         return b;
//     }
//     return `Not a number!`
// }

// min(10, 50);